index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-24 Sun 16:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Short-Term Debt (Money) Markets</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Short-Term Debt (Money) Markets</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc6fbc7d">1. Ask Llama2</a></li>
<li><a href="#org0f9b71a">2. Specific Money Market Securities</a>
<ul>
<li><a href="#orgec24d67">2.1. Treasury Bills (T Bills)</a></li>
<li><a href="#orgdfd4a12">2.2. Repurchase Agreements (Repos)</a>
<ul>
<li><a href="#orgd8f100e">2.2.1. Repo Use by the Fed</a></li>
<li><a href="#org2d6a85b">2.2.2. Repo 105</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Money market securities are debt securities with a maturity of one year or less. Remembering the definition of <i>money</i>:
</p>

<pre class="example" id="orgca31ba6">
Money is anything that (1) is a medium of exchange, and (2) a store of value.
</pre>

<p>
We call them <i>money market</i> securities because they function as money in the economy.  Because they have little interest rate risk they are a good <i>store of value</i>.
</p>

<div id="outline-container-orgc6fbc7d" class="outline-2">
<h2 id="orgc6fbc7d"><span class="section-number-2">1.</span> Ask Llama2</h2>
<div class="outline-text-2" id="text-1">
<iframe src="https://ai-llama2-example.mdbrigida.workers.dev/" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>
</div>
</div>


<div id="outline-container-org0f9b71a" class="outline-2">
<h2 id="org0f9b71a"><span class="section-number-2">2.</span> Specific Money Market Securities</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgec24d67" class="outline-3">
<h3 id="orgec24d67"><span class="section-number-3">2.1.</span> Treasury Bills (T Bills)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
T Bills are short-term debt securities issued by the US Treasury.  You can read about t Bills here:  
</p>
</div>
</div>

<div id="outline-container-orgdfd4a12" class="outline-3">
<h3 id="orgdfd4a12"><span class="section-number-3">2.2.</span> Repurchase Agreements (Repos)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Repos are the most important security that you have never heard of.  They are simply collateralized loans, however these loans can be very useful for managing cash and a firm's balance sheet.
</p>
</div>

<div id="outline-container-orgd8f100e" class="outline-4">
<h4 id="orgd8f100e"><span class="section-number-4">2.2.1.</span> Repo Use by the Fed</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
The Fed often uses repos to make short-term adjustments to monetary policy.  See the Fed's use of reverse repos in the chart below.  Note, a in a reverse repo you are just taking the other side of a repo&#x2014;so you are buying an assets with an agreement to resell the asset at a set price.  So, the Fed uses reverse repos to temporarily increase the money supply.  In the chart below you can see the Fed temporarily increasing the money supply by over $2 trillion in from 2021 to 2024.
</p>

<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1ibh6&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>

<br>
<br>
<br>
</div>
</div>

<div id="outline-container-org2d6a85b" class="outline-4">
<h4 id="org2d6a85b"><span class="section-number-4">2.2.2.</span> Repo 105</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Repo 105 is an (extreme) example of how banks can use repos to manage their balance sheet.  Repo 105 was the name of the repo Lehman used to move poorly-performing assets off their balance sheet prior to taking the balance sheet snapshot.  Once the snapshot was taken, Lehman repurchased the bad assets.  <a href="https://en.wikipedia.org/wiki/Repo_105">See more here.</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2024-03-24 Sun 16:29</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
